Дошкольное_учреждение83/src/Documents/удуКвитанцияОбОплатеПосещенияДОУ/удуКвитанцияОбОплатеПосещенияДОУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуКвитанцияОбОплатеПосещенияДОУ</name>
  <registerRecords>AccumulationRegister.удуВзаиморасчетыСРодителями</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительОплатившийКвитанцию</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОВоспитателя</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </attributes>
</mdclass:Document>

Дошкольное_учреждение83/src/AccumulationRegisters/удуВзаиморасчетыСРодителями/удуВзаиморасчетыСРодителями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>удуВзаиморасчетыСРодителями</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дошкольное_учреждение83/src/Documents/удуКвитанцияОбОплатеПосещенияДОУ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.удуВзаиморасчетыСРодителями.Записывать = Истина;	
	
	Движение = Движения.удуВзаиморасчетыСРодителями.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Учреждение = Учреждение;
	Движение.Ребенок = Ребенок;
	Движение.Сумма = СуммаОплаты;
			
КонецПроцедуры
